import 'package:flutter/material.dart';

extension TaimilStringModificationForPrinting on String {
  String get toPrintPdf {
    List char = [];
    for (var e in characters) {
      if (e.contains('ொ')) {
        String h = e.split('')[0];
        String vl = '${tamMaps['ெ']!}$hா';
        char.add(vl);
      } else if (e.contains('ோ')) {
        String h = e.split('')[0];
        String vl = '${tamMaps['ே']!}$hா';
        char.add(vl);
      } else if (e.contains('ெ')) {
        String h = e.split('')[0];
        String vl = 'ெ$h';
        char.add(vl);
      } else if (e.contains('ே')) {
        String h = e.split('')[0];
        String vl = 'ே$h';
        char.add(vl);
      } else if (e.contains('ௌ')) {
        String h = e.split('')[0];
        String vl = 'ெ$hௗ';
        char.add(vl);
      } else if (e.contains('ை')) {
        String h = e.split('')[0];
        String vl = 'ை$h';
        char.add(vl);
      } else {
        char.add(tamMaps[e] ?? e);
      }
    }
    return char.join('');
  }
}

Map<String, String> tamMaps = {
  'ே': 'ᶏ',
  'ெ': 'ᶎ',
  'கி': 'ᴣ',
  'ஙி': 'ᴤ',
  'சி': 'ᴥ',
  'ஞி': 'ᴨ',
  'டி': 'ᴩ',
  'ணி': 'ᴪ',
  'தி': 'ᴫ',
  'பி': 'ᴮ',
  'நி': 'ᴬ',
  'மி': 'ᴯ',
  'யி': 'ᴰ',
  'ரி': 'ᴱ',
  'லி': 'ᴴ',
  'வி': 'ᴷ',
  'ழி': 'ᴶ',
  'ளி': 'ᴵ',
  'றி': 'ᴳ',
  'னி': 'ᴭ',
  'கீ': 'ᴽ',
  'கு': 'ᵗ',
  'கூ': 'ᵰ',
  'ஙீ': 'ᴾ',
  'ஙு': 'ᵘ',
  'ஙூ': 'ᵱ',
  'சீ': 'ᴿ',
  'சு': 'ᵙ',
  'சூ': 'ᵲ',
  'ஞீ': 'ᵂ',
  'ஞு': 'ᵜ',
  'ஞூ': 'ᵵ',
  'டீ': 'ᵃ',
  'டு': 'ᵝ',
  'டூ': 'ᵶ',
  'ணீ': 'ᵄ',
  'ணு': 'ᵞ',
  'ணூ': 'ᵷ',
  'தீ': 'ᵅ',
  'து': 'ᵟ',
  'தூ': 'ᵸ',
  'நீ': 'ᵆ',
  'நு': 'ᵠ',
  'நூ': 'ᵹ',
  'பீ': 'ᵈ',
  'பு': 'ᵢ',
  'பூ': 'ᵻ',
  'மீ': 'ᵉ',
  'மு': 'ᵣ',
  'மூ': 'ᵼ',
  'யீ': 'ᵊ',
  'யு': 'ᵤ',
  'யூ': 'ᵽ',
  'ரீ': 'ᵋ',
  'ரு': 'ᵥ',
  'ரூ': 'ᵾ',
  'லீ': 'ᵎ',
  'லு': 'ᵧ',
  'லூ': 'ᶀ',
  'வீ': 'ᵑ',
  'வு': 'ᵪ',
  'வூ': 'ᶃ',
  'ழீ': 'ᵐ',
  'ழு': 'ᵩ',
  'ழூ': 'ᶂ',
  'ளீ': 'ᵏ',
  'ளு': 'ᵨ',
  'ளூ': 'ᶁ',
  'றீ': 'ᵍ',
  'று': 'ᵦ',
  'றூ': 'ᵿ',
  'னீ': 'ᵇ',
  'னு': 'ᵡ',
  'னூ': 'ᵺ',
  'க்ஷ': 'ᴀ',
  'க்': 'ᴆ',
  'ங்': 'ᴇ',
  'ச்': 'ᴈ',
  'ஞ்': 'ᴋ',
  'ட்': 'ᴌ',
  'ண்': 'ᴍ',
  'த்': 'ᴎ',
  'ந்': 'ᴏ',
  'ப்': 'ᴑ',
  'ம்': 'ᴒ',
  'ய்': 'ᴓ',
  'ர்': 'ᴔ',
  'ல்': 'ᴗ',
  'வ்': 'ᴚ',
  'ழ்': 'ᴙ',
  'ள்': 'ᴘ',
  'ற்': 'ᴖ',
  'ன்': 'ᴐ',
  'ஶி': 'ᴻ',
  'ஜி': 'ᴦ',
  'ஷி': 'ᴸ',
  'ஸி': 'ᴹ',
  'ஹி': 'ᴺ',
  'க்ஷி': 'ᴼ',
  'ஶீ': 'ᵕ',
  'ஜீ': 'ᵀ',
  'ஷீ': 'ᵒ',
  'ஸீ': 'ᵓ',
  'ஹீ': 'ᵔ',
  'க்ஷீ': 'ᵖ',
  'ஜு': 'ᵚ',
  'ஷு': 'ᵫ',
  'ஸு': 'ᵬ',
  'ஹு': 'ᵭ',
  'ஶு': 'ᵮ',
  'ஶூ': 'ᶇ',
  'ஜூ': 'ᵳ',
  'ஷூ': 'ᶄ',
  'ஸூ': 'ᶅ',
  'ஹூ': 'ᶆ',
  'க்ஷூ': 'ᶈ',
  'ஜ்': 'ᴉ',
  'ஷ்': 'ᴛ',
  'ஶ்': 'ᴞ',
  'ஸ்': 'ᴜ',
  'ஹ்': 'ᴝ',
  'க்ஷ்': 'ᴟ',
  'ஸ்ரீ': 'ᴁ',
  'க்ஷு': '',
  // 'க்ஷு': '',
};
